'use client'
import React from 'react'
import { useState } from 'react';
import { FaFacebook } from "react-icons/fa";
import { FaTelegram } from "react-icons/fa";
import { FaWhatsapp } from "react-icons/fa";
import { FaInstagram } from "react-icons/fa";
import { MdWifiCalling2 } from "react-icons/md";
import { IoCartOutline } from "react-icons/io5";
import { IoIosArrowDown } from "react-icons/io";
import { IoIosArrowUp } from "react-icons/io";
import ScrolToTop from '../../../../utils/SrolToTop';
import Link from 'next/link';
import Image from 'next/image';

export default function Footer() {

    const [quickAccessOpen, setQuickAccess] = useState(false);
    const [importentLinksOpen, setImportentLinks] = useState(false);
    const [contactUsOpen, setContactUs] = useState(false);
    const [isSocialOpen, setIsSocialOpen] = useState(false);


    const toggleQuickAccess = () => setQuickAccess(!quickAccessOpen);
    const toggleImpotentLinks = () => setImportentLinks(!importentLinksOpen);
    const toggleCantact = () => setContactUs(!contactUsOpen);
    const toggleSocials = () => setIsSocialOpen(!isSocialOpen);

    return (

        <footer className="flex flex-col justify-center bg-white  dark:bg-gray-700 dark:text-white text-black py-6">

            <div className='flex justify-end  bg-slate-100   dark:bg-slate-500  translate-y-10  py-6 md:py-20 md:pl-24  z-2'>
                {/* button for got top site */}
                <ScrolToTop />

            </div>
            {/* emty Background */}

            <div className='flex md:flex-col flex-col w-full max-w-screen-xl z-30 mx-auto'>

                {/* Support Section */}
                <div className="container order-1 sm:order-1 md:order-1 w-full z-10 relative py-4 mb-3 dark:bg-slate-900 bg-orange-700 flex md:flex-row px-8 justify-between items-center rounded-md">

                    <div className="flex items-center text-center text-sm  sm:mb-0">
                        <p className="hidden sm:block text-white">در خصوص سفارشات نیاز به راهنمایی دارید؟</p>
                        <p className="md:hidden sm:block felx ml-1 whitespace-nowrap text-sm text-white">نیاز به مشاوره دارید؟</p>
                    </div>

                    <div className="flex  sm:flex-row justify-between gap-[4.76] md:gap-[10]">
                        {/* whats app */}
                        <Link href={'whatsapp'} className="bg-slate-100 dark:bg-slate-700 text-sm sm:text-sm md:mx-3 flex  sm:flex-row items-center justify-center py-1  px-2 rounded-sm w-full gap-[4.76]">
                            <p className="text-sm whitespace-nowrap">پشتیبانی آنلاین</p>
                            <svg className=' w-[12px] h-[12px] md:w-[28px] md:h-[29px]'  viewBox="0 0 28 29" fill="none" xmlns="http://www.w3.org/2000/svg">
                                <path d="M0 28.0283L1.90185 21.0804C0.728274 19.0466 0.111609 16.7412 0.112736 14.3771C0.116118 6.98614 6.13058 0.97168 13.5204 0.97168C17.1065 0.972807 20.4728 2.3696 23.0049 4.90391C25.5358 7.43821 26.9292 10.8068 26.9281 14.3895C26.9247 21.7816 20.9103 27.7961 13.5204 27.7961C11.277 27.7949 9.06622 27.2324 7.108 26.1636L0 28.0283ZM7.43719 23.7364C9.32664 24.8582 11.1304 25.5301 13.5159 25.5312C19.6578 25.5312 24.661 20.5325 24.6644 14.3872C24.6666 8.22962 19.6871 3.23767 13.5249 3.23542C7.37856 3.23542 2.37873 8.23413 2.37647 14.3782C2.37534 16.8866 3.11038 18.7648 4.34484 20.7298L3.21861 24.8424L7.43719 23.7364ZM20.2744 17.5765C20.191 17.4368 19.9678 17.3533 19.6318 17.1854C19.297 17.0174 17.6499 16.2068 17.3422 16.0952C17.0355 15.9836 16.8123 15.9272 16.588 16.2632C16.3647 16.598 15.7221 17.3533 15.5271 17.5765C15.3321 17.7998 15.1359 17.8279 14.8011 17.66C14.4663 17.492 13.3863 17.1391 12.1067 15.9971C11.1112 15.1088 10.4382 14.0118 10.2432 13.6759C10.0481 13.3411 10.2229 13.1596 10.3897 12.9927C10.5408 12.8428 10.7246 12.6015 10.8925 12.4054C11.0628 12.2114 11.118 12.0717 11.2307 11.8473C11.3424 11.6241 11.2871 11.4279 11.2026 11.26C11.118 11.0931 10.4484 9.44378 10.1699 8.773C9.89708 8.12026 9.62088 8.2082 9.4157 8.19805L8.77311 8.18678C8.54989 8.18678 8.18688 8.2702 7.88024 8.60615C7.5736 8.94211 6.70778 9.75155 6.70778 11.4009C6.70778 13.0502 7.90842 14.6432 8.07527 14.8664C8.24325 15.0896 10.4371 18.4739 13.7977 19.9248C14.597 20.2698 15.2216 20.4761 15.7075 20.6306C16.5102 20.8853 17.2407 20.8493 17.8179 20.7636C18.4616 20.6678 19.7998 19.953 20.0794 19.1706C20.359 18.3871 20.359 17.7163 20.2744 17.5765Z" stroke='#25D366' fill="#4D4D4D" />
                            </svg>

                        </Link>


                        {/* Phone Support */}
                        <div className=" bg-slate-100 py-3 dark:bg-slate-700 flex items-center justify-center    rounded-sm w-full sm:w-auto  gap-[4.76] " >
                            <p>۰۲۱-۴۲۵۶</p>
                            <svg className='w-[19px] h-[19px]' width="40" height="41" viewBox="0 0 40 41" fill="none" xmlns="http://www.w3.org/2000/svg">
                                <path fillRule="evenodd" clipRule="evenodd" d="M22.083 5.50004C22.083 4.80968 22.6427 4.25004 23.333 4.25004C25.0292 4.25004 26.7089 4.58414 28.276 5.23326C29.8431 5.88239 31.267 6.83382 32.4665 8.03324C33.6659 9.23267 34.6173 10.6566 35.2665 12.2237C35.9156 13.7908 36.2497 15.4705 36.2497 17.1667C36.2497 17.8571 35.69 18.4167 34.9997 18.4167C34.3093 18.4167 33.7497 17.8571 33.7497 17.1667C33.7497 15.7988 33.4802 14.4442 32.9568 13.1804C32.4333 11.9166 31.666 10.7683 30.6987 9.80101C29.7314 8.83373 28.5831 8.06645 27.3193 7.54296C26.0555 7.01948 24.7009 6.75004 23.333 6.75004C22.6427 6.75004 22.083 6.1904 22.083 5.50004ZM22.083 11.3334C22.083 10.643 22.6427 10.0834 23.333 10.0834C24.2632 10.0834 25.1843 10.2666 26.0437 10.6226C26.9031 10.9785 27.6839 11.5003 28.3417 12.158C28.9994 12.8158 29.5212 13.5966 29.8772 14.456C30.2331 15.3154 30.4163 16.2365 30.4163 17.1667C30.4163 17.8571 29.8567 18.4167 29.1663 18.4167C28.476 18.4167 27.9163 17.8571 27.9163 17.1667C27.9163 16.5648 27.7978 15.9688 27.5675 15.4127C27.3371 14.8567 26.9995 14.3514 26.5739 13.9258C26.1483 13.5002 25.643 13.1626 25.087 12.9323C24.5309 12.7019 23.9349 12.5834 23.333 12.5834C22.6427 12.5834 22.083 12.0237 22.083 11.3334Z" stroke='#25D366' fill="#383A40" />
                                <path d="M10.2307 4.69397L15.6312 12.0582C16.1812 12.8083 15.9942 13.8658 15.2203 14.3818C13.4135 15.5863 12.6776 17.8357 13.9052 19.6269C14.6452 20.7066 15.6746 21.9995 17.0874 23.4123C18.5002 24.8251 19.7931 25.8545 20.8728 26.5945C22.664 27.8221 24.9135 27.0862 26.118 25.2794C26.6339 24.5055 27.6914 24.3185 28.4415 24.8686L35.8057 30.269C36.9852 31.134 36.9455 32.9083 35.7285 33.7196L32.667 35.7606C30.4988 37.2061 27.86 37.7126 25.5869 36.4384C22.9792 34.9767 19.0008 32.1759 13.6623 26.8374C8.32377 21.4989 5.52297 17.5205 4.06129 14.9128C2.78713 12.6397 3.29359 10.0009 4.73907 7.83271L6.78009 4.77119C7.59141 3.5542 9.36574 3.5145 10.2307 4.69397Z" stroke='#25D366' fill="#383A40" />
                            </svg>
                        </div>
                    </div>


                </div>



                {/* Important Links and Other Links Section */}
                <div className="container order-2 sm:order-3 md:order-2 mx-auto px-4 py-6">
                    <div className="grid grid-cols-1 text-[#4D4D4D] dark:text-white sm:grid-cols-2 lg:grid-cols-3 gap-6">

                        {/* Quick Access links */}
                        <div className="min-w-[200px]">
                            <h2
                                className="md:hidden sm:block dark:bg-slate-800 flex items-center justify-between py-3 rounded-md px-2 bg-slate-100 text-base font-bold mb-4 cursor-pointer sm:mb-2 sm:block transition-all duration-500 ease-in-out"
                                onClick={toggleQuickAccess}
                            >
                                دسترسی سریع

                                {quickAccessOpen ? (<IoIosArrowUp />) : (<IoIosArrowDown />)}
                            </h2>


                            <h2
                                className="hidden sm:block text-lg font-bold mb-4 cursor-pointer sm:mb-2"

                            >
                                دسترسی سریع
                            </h2>
                            <ul
                                className={`space-y-2 ${quickAccessOpen ? 'block' : 'hidden'} sm:block sm:space-y-1 transition`}
                            >
                                <li><Link href="">رهگیری مرسولات</Link></li>
                                <li><Link href="">سوالات متداول</Link></li>
                                <li><Link href="">قوانین و مقررات</Link></li>
                                <li><Link href="">دربارهما</Link></li>
                            </ul>
                        </div>

                        {/* Important Links */}
                        <div className="min-w-[200px] sm:w-full">
                            <h2
                                className="md:hidden sm:block -mt-5 dark:bg-slate-800 flex items-center justify-between py-3 rounded-md px-2 bg-slate-100 text-base font-bold mb-4 cursor-pointer sm:mb-2 sm:block"
                                onClick={toggleImpotentLinks}
                            >
                                لینک های مهم
                                {importentLinksOpen ? (<IoIosArrowUp />) : (<IoIosArrowDown />)}
                            </h2>


                            <h2
                                className="hidden sm:block text-lg font-bold mb-4 cursor-pointer sm:mb-2"

                            >
                                لینک های مهم
                            </h2>

                            <ul
                                className={`space-y-2 ${importentLinksOpen ? 'block' : 'hidden'} sm:block md:block sm:w-full md:w-auto`} // Full width on mobile (sm) and auto width on larger screens (md+)
                            >
                                <li><Link href="">رهگیری مرسولات</Link></li>
                                <li><Link href="">سوالات متداول</Link></li>
                                <li><Link href="">قوانین و مقررات</Link></li>
                                <li><Link href="">درباره ما</Link></li>
                            </ul>
                        </div>

                        {/* Contact Information */}
                        <div className="min-w-[200px] sm:w-full">
                            <h2
                                className="md:hidden sm:block -mt-5 dark:bg-slate-800 flex items-center justify-between py-3 rounded-md px-2 bg-slate-100 text-base font-bold mb-4 cursor-pointer sm:mb-2 sm:block"
                                onClick={toggleCantact}
                            >
                                ارتباط با ما
                                {contactUsOpen ? (<IoIosArrowUp />) : (<IoIosArrowDown />)}
                            </h2>

                            <div
                                className={`dark:bg-slate-800 bg-slate-100 rounded-md p-5 ${contactUsOpen ? 'block' : 'hidden'} sm:block`}
                            >
                                <ul className="space-y-2 text-black dark:text-white">
                                    <li className="border-r-2 border-orange-600 pr-2">
                                        آدرس: تهران، خیابان نلسون ماندلا (جردن سابق)
                                    </li>
                                    <li className="border-r-2 border-orange-600 pr-2">
                                        شماره تماس: ۰۲۱-۲۱۲۳۴ - ۲۱۲۴۱
                                    </li>
                                    <li className="border-r-2 border-orange-600 pr-2">
                                        آدرس ایمیل: sales@tntiran.com
                                    </li>
                                    <li className="border-r-2 border-orange-600 pr-2">
                                        شنبه تا چهارشنبه: 8 الی 16 - پنجشنبه: 8 الی 13
                                    </li>
                                </ul>
                            </div>
                        </div>

                        {/* social links  */}
                        <div className="block md:hidden min-w-[200px] sm:w-full">
                            <h2
                                className="md:hidden sm:block -mt-5 dark:bg-slate-800 flex items-center justify-between py-3 rounded-md px-2 bg-slate-100 text-base font-bold mb-4 cursor-pointer sm:mb-2 sm:block"
                                onClick={toggleSocials}
                            >
                                شبکه های اجتماعی
                                {isSocialOpen ? (<IoIosArrowUp />) : (<IoIosArrowDown />)}
                            </h2>

                            <div
                                className={`dark:bg-slate-800 bg-slate-100 rounded-md p-5 ${isSocialOpen ? 'block' : 'hidden'} sm:block`}
                            >
                                <div className="flex space-x-4 items-center justify-between">
                                    <Link href={''}>
                                        <FaFacebook className="text-blue-500  mx-3 dark:bg-slate-800 bg-white p-1 rounded-sm" size={30} />
                                    </Link>
                                    <Link href={''}>
                                        <FaTelegram className="text-blue-700 dark:bg-slate-800 bg-white p-1 rounded-sm" size={30} />
                                    </Link>
                                    <Link href={''}>
                                        <FaWhatsapp className="text-green-700 dark:bg-slate-800 bg-white p-1 rounded-sm" size={30} />
                                    </Link>
                                    <Link href={''}>
                                        <FaInstagram className="text-pink-700 dark:bg-slate-800 bg-white p-1 rounded-sm" size={30} />
                                    </Link>
                                </div>


                            </div>
                        </div>


                    </div>
                </div>



                {/* About Section */}

                <div className="container order-1 my-0 sm:order-2 md:order-3 w-full md:h-[120px]  grid grid-cols-1 md:grid-cols-2 gap-6 items-center justify-between mb-6 mt-6 mx-auto px-4">
                    <div className="flex flex-col items-center md:items-start text-center md:text-left">

                        <div className="flex flex-col sm:flex-col md:flex-row md:max-w-[738px] items-center justify-center  md:justify-start space-x-3">
                            {/* cart icon svg */}
                            <svg width="49" height="39" viewBox="0 0 49 39" fill="none" xmlns="http://www.w3.org/2000/svg">
                                <g clipPath="url(#clip0_3146_15493)">
                                    <path d="M26.4443 35.8865C26.4438 36.4053 26.2623 36.9079 25.9308 37.3086C25.5993 37.7093 25.1383 37.9833 24.6264 38.0839C24.1144 38.1846 23.5832 38.1056 23.1233 37.8605C22.6634 37.6153 22.3032 37.2192 22.1041 36.7396C21.9051 36.2601 21.8794 35.7267 22.0316 35.2305C22.1838 34.7342 22.5044 34.3058 22.9388 34.0182C23.3731 33.7306 23.8943 33.6017 24.4136 33.6534C24.9329 33.7051 25.418 33.9342 25.7864 34.3016C25.9963 34.5093 26.1625 34.7563 26.2754 35.0284C26.3883 35.3005 26.4457 35.5922 26.4443 35.8865Z" fill="#FA5A2A" />
                                    <path d="M37.7079 35.8865C37.7074 36.4053 37.526 36.9079 37.1945 37.3086C36.863 37.7093 36.402 37.9833 35.8901 38.0839C35.3781 38.1846 34.8469 38.1056 34.387 37.8605C33.9271 37.6153 33.5669 37.2192 33.3678 36.7396C33.1687 36.2601 33.1431 35.7267 33.2953 35.2305C33.4475 34.7342 33.7681 34.3058 34.2025 34.0182C34.6368 33.7306 35.158 33.6017 35.6773 33.6534C36.1965 33.7051 36.6817 33.9342 37.0501 34.3016C37.2599 34.5093 37.4261 34.7563 37.5391 35.0284C37.652 35.3005 37.7094 35.5922 37.7079 35.8865Z" fill="#FA5A2A" />
                                    <path d="M48.083 14.3533L44.1787 8.76367H40.293L45.2006 15.7899C45.4379 16.1266 45.5519 16.5341 45.5235 16.9443C45.4952 17.3545 45.3262 17.7427 45.0449 18.044C44.7519 18.3658 44.3498 18.5688 43.9156 18.6141L13.9461 18.6261L10.636 13.8584H6.5332L19.2264 32.1455H36.3262C40.4333 32.1455 42.8466 27.5566 40.5024 24.2037L39.1659 22.2951H43.9057C48.0129 22.2951 50.4272 17.705 48.083 14.3533ZM36.336 28.47C36.3009 28.47 20.7483 28.482 20.7483 28.482L16.5051 22.3452H35.3153L37.6177 25.6447C37.7967 25.9011 37.9059 26.1992 37.9345 26.5099C37.9632 26.8207 37.9105 27.1336 37.7814 27.4181C37.6523 27.7025 37.4514 27.949 37.1981 28.1333C36.9448 28.3176 36.6478 28.4336 36.336 28.47Z" fill="#FA5A2A" />
                                    <path d="M32.3176 12.4905L35.6408 17.2538H31.7573L30.1269 14.919C29.6028 14.1696 28.904 13.5573 28.0903 13.1344C27.2766 12.7115 26.3721 12.4906 25.454 12.4905H5.57593L5.53865 12.436L2.97852 8.77134C11.2334 8.77134 36.5508 8.7648 38.6187 8.77134L41.2248 12.4905H32.3176Z" fill="#FA5A2A" />
                                    <path d="M6.18732 7.39901H2.08233L0.876274 5.67134C-1.22556 2.44272 1.10543 0.124268 1.10543 0.124268L6.18732 7.39901Z" fill="#FA5A2A" />
                                </g>
                                <defs>
                                    <clipPath id="clip0_3146_15493">
                                        <rect width="49" height="38" fill="white" transform="translate(0 0.124268)" />
                                    </clipPath>
                                </defs>
                            </svg>
                            <h1 className="text-xl md:text-2xl font-bold">شرکت خدمات حمل نقل ران اکسپرس</h1>
                            {/* social icons just show in mobile view  */}
                            <div className="block md:hidden min-w-[200px] sm:w-full ">

                                <div
                                    className='rounded-md pt-3'
                                >
                                    <div className="flex space-x-4 mb-2 items-center justify-between">
                                        <Link href={''}>
                                            <FaFacebook className="text-blue-500  mx-3  bg-slate-100  dark:bg-slate-800    p-1 rounded-sm" size={30} />
                                        </Link>
                                        <Link href={''}>
                                            <FaTelegram className="text-blue-700 bg-slate-100 dark:bg-slate-800  p-1 rounded-sm" size={30} />
                                        </Link>
                                        <Link href={''}>
                                            <FaWhatsapp className="text-green-700 bg-slate-100 dark:bg-slate-800  p-1 rounded-sm" size={30} />
                                        </Link>
                                        <Link href={''}>
                                            <FaInstagram className="text-pink-700 bg-slate-100 dark:bg-slate-800  p-1 rounded-sm" size={30} />
                                        </Link>
                                    </div>


                                </div>
                            </div>

                        </div>



                        <p className="hidden sm:block mt-3 text-right text-[#4D4D4D] dark:text-white text-[14px] md:text-base">
                            پست سریع بین المللی تی‌ان‌تی ایران، از سال ۱۹۸۱ فعالیت خود را آغاز کرده و با بیش از چهل سال تجربه،
                            به عنوان یکی از پیشگامان خدمات پستی در ایران شناخته می‌شود. این شرکت دارای نمایندگی‌های فعال در
                            شهرهای مختلف ایران است و خدمات گسترده‌ای را ارائه می‌دهد که شامل راهکارهای نوین زنجیره حمل و نقل می‌شود.
                        </p>
                    </div>

                    {/* logos */}
                    <div className="hidden sm:flex container md:justify-end items-center gap-6 md:gap-14 w-full max-w-screen-xl  mx-auto ">

                        {/* TNT icon */}
                        <svg width="99" height="36" viewBox="0 0 99 36" fill="none" xmlns="http://www.w3.org/2000/svg">
                            <g clipPath="url(#clip0_3146_15457)">
                                <path d="M56.0135 10.1286C56.0788 10.1279 56.1435 10.1402 56.2039 10.1649C56.2643 10.1895 56.3192 10.226 56.3654 10.2722C56.4115 10.3183 56.448 10.3732 56.4726 10.4336C56.4973 10.494 56.5096 10.5587 56.509 10.624V25.6652C56.5099 25.7254 56.4988 25.7851 56.4763 25.8408C56.4537 25.8966 56.4202 25.9472 56.3777 25.9897C56.3351 26.0323 56.2845 26.0658 56.2287 26.0884C56.173 26.1109 56.1133 26.122 56.0532 26.121H52.9419C52.7409 26.0933 52.5538 26.0032 52.4068 25.8634C52.4068 25.8634 46.8184 18.1942 46.64 17.996C46.4882 17.773 46.3619 17.5337 46.2635 17.2826V25.6652C46.2639 25.7269 46.2517 25.788 46.2277 25.8448C46.2037 25.9016 46.1683 25.9529 46.1238 25.9955C46.0793 26.0382 46.0265 26.0713 45.9688 26.0929C45.911 26.1145 45.8494 26.124 45.7879 26.121H42.3C42.2384 26.124 42.1769 26.1145 42.1191 26.0929C42.0614 26.0713 42.0086 26.0382 41.9641 25.9955C41.9196 25.9529 41.8842 25.9016 41.8602 25.8448C41.8362 25.788 41.824 25.7269 41.8244 25.6652V10.624C41.824 10.5623 41.8362 10.5012 41.8602 10.4444C41.8842 10.3877 41.9196 10.3364 41.9641 10.2937C42.0086 10.251 42.0614 10.2179 42.1191 10.1963C42.1769 10.1747 42.2384 10.1652 42.3 10.1682H45.4113C45.6077 10.192 45.7897 10.2831 45.9266 10.4258C45.9266 10.4258 51.4556 17.9563 51.6934 18.2932C51.8482 18.5177 51.981 18.7566 52.0897 19.0067V10.624C52.0887 10.5639 52.0998 10.5041 52.1224 10.4484C52.145 10.3926 52.1785 10.342 52.221 10.2995C52.2635 10.257 52.3142 10.2234 52.3699 10.2009C52.4257 10.1783 52.4854 10.1672 52.5455 10.1682C52.5455 10.1286 55.7955 10.1286 56.0135 10.1286ZM80.5868 31.9076C73.0167 31.9076 66.8535 25.7247 66.8535 18.1347C66.8535 10.5249 73.0167 4.34194 80.5868 4.34194C88.1372 4.34194 94.3003 10.5249 94.3003 18.1347C94.3003 25.7247 88.1372 31.9076 80.5868 31.9076ZM49.1766 31.9076C41.6064 31.9076 35.4433 25.7247 35.4433 18.1347C35.4433 10.5249 41.6064 4.34194 49.1766 4.34194C56.7269 4.34194 62.8901 10.5249 62.8901 18.1347C62.8901 25.7247 56.7269 31.9076 49.1766 31.9076ZM17.7664 31.9076C10.1962 31.9076 4.03306 25.7247 4.03306 18.1347C4.03306 10.5249 10.1962 4.34194 17.7664 4.34194C25.3167 4.34194 31.4799 10.5249 31.4799 18.1347C31.46 25.7247 25.2969 31.9076 17.7664 31.9076ZM80.5868 0.338869C73.7697 0.338869 67.8444 4.24285 64.852 9.93039C63.3671 7.04174 61.1147 4.61826 58.3424 2.92617C55.57 1.23408 52.3849 0.338867 49.137 0.338867C45.889 0.338867 42.7039 1.23408 39.9315 2.92617C37.1592 4.61826 34.9068 7.04174 33.4219 9.93039C31.931 7.04244 29.6745 4.62016 26.8993 2.9285C24.1242 1.23684 20.9372 0.340961 17.6871 0.338869C7.99649 0.338869 0.0498047 8.32519 0.0498047 18.1347C0.0498047 27.9244 7.99649 35.9107 17.7664 35.9107C24.5637 35.9107 30.5088 32.0067 33.4814 26.3192C34.9701 29.2047 37.2234 31.6255 39.9949 33.317C42.7664 35.0086 45.9495 35.9058 49.1964 35.9107C56.0135 35.9107 61.9389 32.0067 64.9313 26.3192C66.418 29.2064 68.6707 31.6286 71.4427 33.3204C74.2147 35.0122 77.3988 35.9084 80.6463 35.9107C90.4162 35.9107 98.3628 27.9244 98.3628 18.1347C98.3034 8.32519 90.3369 0.338869 80.5868 0.338869ZM11.1078 10.4258C11.0477 10.4248 10.9879 10.4359 10.9322 10.4585C10.8765 10.481 10.8258 10.5146 10.7833 10.5571C10.7408 10.5996 10.7072 10.6503 10.6847 10.706C10.6621 10.7618 10.651 10.8215 10.652 10.8816V13.874C10.651 13.9341 10.6621 13.9938 10.6847 14.0496C10.7072 14.1053 10.7408 14.156 10.7833 14.1985C10.8258 14.241 10.8765 14.2746 10.9322 14.2971C10.9879 14.3197 11.0477 14.3308 11.1078 14.3298H14.7145C14.9469 14.3278 15.1788 14.3079 15.4081 14.2703V26.0616C15.4071 26.1217 15.4182 26.1814 15.4408 26.2372C15.4633 26.2929 15.4969 26.3436 15.5394 26.3861C15.5819 26.4286 15.6326 26.4621 15.6883 26.4847C15.7441 26.5072 15.8038 26.5184 15.8639 26.5174H19.5697C19.6299 26.5184 19.6896 26.5072 19.7453 26.4847C19.8011 26.4621 19.8517 26.4286 19.8942 26.3861C19.9368 26.3436 19.9703 26.2929 19.9928 26.2372C20.0154 26.1814 20.0265 26.1217 20.0255 26.0616V14.2703C20.3148 14.3063 20.6059 14.3262 20.8975 14.3298H24.3457C24.4058 14.3308 24.4655 14.3197 24.5213 14.2971C24.577 14.2746 24.6276 14.241 24.6702 14.1985C24.7127 14.156 24.7462 14.1053 24.7688 14.0496C24.7913 13.9938 24.8025 13.9341 24.8015 13.874V10.8816C24.8025 10.8215 24.7913 10.7618 24.7688 10.706C24.7462 10.6503 24.7127 10.5996 24.6702 10.5571C24.6276 10.5146 24.577 10.481 24.5213 10.4585C24.4655 10.4359 24.4058 10.4248 24.3457 10.4258H11.1078ZM87.2256 10.4258C87.2857 10.4248 87.3454 10.4359 87.4012 10.4585C87.4569 10.481 87.5076 10.5146 87.5501 10.5571C87.5926 10.5996 87.6262 10.6503 87.6487 10.706C87.6713 10.7618 87.6824 10.8215 87.6814 10.8816V13.874C87.6824 13.9341 87.6713 13.9938 87.6487 14.0496C87.6262 14.1053 87.5926 14.156 87.5501 14.1985C87.5076 14.241 87.4569 14.2746 87.4012 14.2971C87.3454 14.3197 87.2857 14.3308 87.2256 14.3298H83.7972C83.4991 14.3267 83.2013 14.3068 82.9054 14.2703V26.0616C82.9064 26.1217 82.8953 26.1814 82.8728 26.2372C82.8502 26.2929 82.8167 26.3436 82.7741 26.3861C82.7316 26.4286 82.681 26.4621 82.6252 26.4847C82.5695 26.5072 82.5098 26.5184 82.4496 26.5174H78.7438C78.6837 26.5184 78.624 26.5072 78.5682 26.4847C78.5125 26.4621 78.4618 26.4286 78.4193 26.3861C78.3768 26.3436 78.3433 26.2929 78.3207 26.2372C78.2982 26.1814 78.287 26.1217 78.288 26.0616V14.2703C78.0587 14.3079 77.8268 14.3278 77.5944 14.3298H73.9877C73.9276 14.3308 73.8679 14.3197 73.8121 14.2971C73.7564 14.2746 73.7057 14.241 73.6632 14.1985C73.6207 14.156 73.5871 14.1053 73.5646 14.0496C73.542 13.9938 73.5309 13.9341 73.5319 13.874V10.8816C73.5309 10.8215 73.542 10.7618 73.5646 10.706C73.5871 10.6503 73.6207 10.5996 73.6632 10.5571C73.7057 10.5146 73.7564 10.481 73.8121 10.4585C73.8679 10.4359 73.9276 10.4248 73.9877 10.4258H87.2256Z" fill="#FA5A2A" />
                            </g>
                            <defs>
                                <clipPath id="clip0_3146_15457">
                                    <rect width="98.313" height="35.5718" fill="white" transform="translate(0.0498047 0.338379)" />
                                </clipPath>
                            </defs>
                        </svg>

                        {/* DhlIcon */}
                        <svg width="100" height="46" viewBox="0 0 100 46" fill="none" xmlns="http://www.w3.org/2000/svg">
                            <g clipPath="url(#clip0_3146_15460)">
                                <g clipPath="url(#clip1_3146_15460)">
                                    <path d="M0.0253906 29.1042H12.0523L11.3611 30.0719H0.0253906V29.1042Z" fill="#D40511" />
                                    <path d="M99.2128 30.0719H84.4902L85.2506 29.1042H99.2819V30.0719H99.2128Z" fill="#D40511" />
                                    <path d="M0.0253906 27.3071H13.4347L12.6743 28.2748H0.0253906V27.3071Z" fill="#D40511" />
                                    <path d="M0.0253906 25.5106H14.8171L14.0567 26.4783H0.0253906V25.5106Z" fill="#D40511" />
                                    <path d="M99.2132 28.2748H85.873L86.6334 27.3071H99.2823V28.2748H99.2132Z" fill="#D40511" />
                                    <path d="M87.9459 25.5106H99.2124V26.4783H87.1855L87.9459 25.5106Z" fill="#D40511" />
                                    <path d="M13.0195 30.0721L19.3786 21.5703C19.3786 21.5703 26.4288 21.5703 27.2582 21.5703C28.1568 21.5703 28.1568 21.9159 27.673 22.4689C27.2582 23.0218 26.4979 24.0586 26.0832 24.6116C25.8758 24.9572 25.4611 25.441 26.7744 25.441C28.2259 25.441 37.3498 25.441 37.3498 25.441C36.5203 26.6852 33.6173 30.1412 28.5024 30.1412C24.3552 30.0721 13.0195 30.0721 13.0195 30.0721Z" fill="#D40511" />
                                    <path d="M49.4463 25.5106L45.9903 30.1417H36.9355L40.3915 25.5106H49.4463Z" fill="#D40511" />
                                    <path d="M62.6482 25.5106L59.1922 30.1417H50.0684L53.5244 25.5106H62.6482Z" fill="#D40511" />
                                    <path d="M65.6205 25.5106C65.6205 25.5106 64.9293 26.4092 64.6528 26.8239C63.4778 28.3445 64.5146 30.1417 68.2471 30.1417C72.5325 30.1417 82.9005 30.1417 82.9005 30.1417L86.3565 25.5106H65.6205Z" fill="#D40511" />
                                    <path d="M17.5135 16.3168L14.334 20.5331C14.334 20.5331 30.7154 20.5331 31.614 20.5331C32.5125 20.5331 32.5125 20.8787 32.0287 21.4317C31.614 21.9846 30.8537 23.0214 30.4389 23.5744C30.2316 23.8509 29.8169 24.4038 31.1301 24.4038C32.5816 24.4038 38.1804 24.4038 38.1804 24.4038C38.1804 24.4038 39.3554 22.8832 40.254 21.5699C41.5672 19.8419 40.3922 16.2477 35.7612 16.2477C31.614 16.3168 17.5135 16.3168 17.5135 16.3168Z" fill="#D40511" />
                                    <path d="M63.409 24.4039H41.1523L47.2349 16.3169H56.3587L52.9027 20.9479H56.9808L60.4368 16.3169H69.5606L63.409 24.4039Z" fill="#D40511" />
                                    <path d="M82.1402 16.3169L76.0577 24.4039H66.3809L72.4634 16.3169H82.1402Z" fill="#D40511" />
                                </g>
                            </g>
                            <defs>
                                <clipPath id="clip0_3146_15460">
                                    <rect width="98.3755" height="44.7756" fill="white" transform="translate(0.716797 0.73645)" />
                                </clipPath>
                                <clipPath id="clip1_3146_15460">
                                    <rect width="99.1871" height="13.824" fill="white" transform="translate(0.0263672 16.3169)" />
                                </clipPath>
                            </defs>
                        </svg>


                        {/* feedExpress Icon */}

                        <svg width="99" height="46" viewBox="0 0 99 46" fill="none" xmlns="http://www.w3.org/2000/svg">
                            <g clipPath="url(#clip0_3146_15477)">
                                <path d="M79.568 10.9969L83.4985 15.3287L87.2825 10.9969H95.3626L87.466 19.8768L95.4708 28.8293H87.0647L83.1712 24.4633L79.3133 28.8293H71.1963L79.1312 19.9138L71.1963 10.9969H79.568Z" fill="#FA5A2A" />
                                <path d="M71.1987 10.9956V17.0207H62.2119V22.5495H71.1987V28.8279H55.6074V0.737793H71.1987V6.99911H62.2119V10.9956H71.1987Z" fill="#FA5A2A" />
                                <path d="M49.0299 0.737671V12.2335H48.9573C47.5002 10.5599 45.6815 9.97787 43.5711 9.97787C39.2473 9.97787 35.9899 12.9185 34.8469 16.8041C33.5416 12.5225 30.1787 9.89736 25.1923 9.89736C21.143 9.89736 17.9451 11.7148 16.2768 14.6765V10.9955H7.90636V6.99899H17.041V0.737671H0.445312V28.8278H7.90636V17.0205H15.3437C15.1219 17.8877 15.0031 18.8168 15.0031 19.7975C15.0031 25.6562 19.48 29.7689 25.1923 29.7689C29.9965 29.7689 33.1628 27.5133 34.8364 23.402H28.4417C27.5772 24.6386 26.9213 25.0042 25.1923 25.0042C23.1875 25.0042 21.4585 23.2554 21.4585 21.182H34.4787C35.0436 25.8357 38.6692 29.8494 43.6437 29.8494C45.7897 29.8494 47.755 28.7935 48.956 27.0117H49.0286V28.8304H55.6054V0.737671H49.0299ZM21.667 17.1037C22.0814 15.3193 23.4659 14.1538 25.1936 14.1538C27.0955 14.1538 28.4087 15.2836 28.7545 17.1037C28.8997 17.1037 21.667 17.1037 21.667 17.1037ZM45.0374 24.5515C42.6129 24.5515 41.1056 22.292 41.1056 19.9334C41.1056 17.4125 42.4162 14.988 45.0374 14.988C47.7549 14.988 48.8372 17.4125 48.8372 19.9334C48.8372 22.3236 47.6903 24.5515 45.0374 24.5515Z" fill="#2A007C" />
                                <path d="M55.6074 42.8739V32.8075H61.1692V33.5585H56.5247V37.2699H60.9726V38.0209H56.5247V42.1203H61.3764V42.8726L55.6074 42.8739Z" fill="#2A007C" />
                                <path d="M62.04 42.8743L64.7523 39.2593L62.1799 35.8396H63.2226L65.3225 38.6337L67.3801 35.8396H68.4228L65.8095 39.2593L68.5337 42.8743H67.4778L65.2248 39.8836L63.084 42.8743H62.04Z" fill="#2A007C" />
                                <path d="M70.2981 45.5122H69.4495V37.9377C69.4495 37.2421 69.4495 36.5347 69.4072 35.8378H70.2427L70.2704 36.895C70.797 36.0595 71.4926 35.6715 72.5366 35.6715C74.7051 35.6715 75.6356 37.4639 75.6356 39.3539C75.6356 41.2465 74.7051 43.0389 72.5366 43.0389C71.5625 43.0389 70.7983 42.664 70.2981 41.8563V45.5122ZM74.7328 39.3539C74.7328 37.8532 74.1059 36.3789 72.4389 36.3789C70.8683 36.3789 70.2981 37.6724 70.2981 39.3539C70.2981 41.0367 70.8683 42.3288 72.4389 42.3288C74.1072 42.3288 74.7328 40.8558 74.7328 39.3539Z" fill="#2A007C" />
                                <path d="M79.999 36.4898C78.5947 36.4898 78.1064 37.6724 78.1064 38.8946V42.8726H77.2577V37.9073C77.2577 37.2263 77.2445 36.5334 77.2168 35.8378H78.0536L78.1077 36.8528C78.5248 36.0477 79.2216 35.6715 80.1521 35.6715C80.2775 35.6715 80.4161 35.6847 80.5415 35.6992V36.5479C80.3461 36.5175 80.193 36.4898 79.999 36.4898Z" fill="#2A007C" />
                                <path d="M81.5786 39.507C81.5786 41.0908 82.3283 42.3974 83.8712 42.3974C85.0656 42.3974 85.6226 41.6055 85.8311 40.8136H86.6375C86.2614 42.2865 85.3573 43.0389 83.759 43.0389C81.6182 43.0389 80.6719 41.4537 80.6719 39.4806C80.6719 37.4652 81.6591 35.6715 83.8698 35.6715C86.1083 35.6715 86.7062 37.6302 86.7062 39.507H81.5786ZM81.605 38.8682H85.8034C85.8034 37.4916 85.1514 36.3103 83.8157 36.3103C82.6068 36.309 81.7713 37.2263 81.605 38.8682Z" fill="#2A007C" />
                                <path d="M90.0181 43.0389C88.5728 43.0389 87.4893 42.3565 87.4893 40.8136H88.3379C88.3379 41.8695 89.0322 42.3974 90.0616 42.3974C91.0212 42.3974 91.7708 41.9381 91.7708 40.9957C91.7708 40.1471 90.8958 39.924 89.9785 39.6601C88.8672 39.3407 87.6569 38.9922 87.6569 37.6301C87.6569 36.1163 88.9213 35.6715 90.1039 35.6715C91.4646 35.6715 92.4809 36.1981 92.5218 37.6579H91.6732C91.6322 36.825 91.0343 36.3525 90.1303 36.3525C89.4215 36.3525 88.5597 36.6297 88.5597 37.547C88.5597 38.3825 89.4215 38.6187 90.3388 38.8682C91.4527 39.173 92.6749 39.507 92.6749 40.8704C92.6736 42.4542 91.4514 43.0389 90.0181 43.0389Z" fill="#2A007C" />
                                <path d="M95.8993 43.0389C94.4527 43.0389 93.3691 42.3565 93.3691 40.8136H94.2178C94.2178 41.8695 94.912 42.3974 95.9428 42.3974C96.9024 42.3974 97.652 41.9381 97.652 40.9957C97.652 40.1471 96.7756 39.924 95.8584 39.6601C94.7471 39.3407 93.5381 38.9922 93.5381 37.6301C93.5381 36.1163 94.8025 35.6715 95.9851 35.6715C97.3458 35.6715 98.3621 36.1981 98.403 37.6579H97.5543C97.5134 36.825 96.9155 36.3525 96.0115 36.3525C95.3027 36.3525 94.4409 36.6297 94.4409 37.547C94.4409 38.3825 95.3027 38.6187 96.2213 38.8682C97.3339 39.173 98.5574 39.507 98.5574 40.8704C98.5548 42.4542 97.3313 43.0389 95.8993 43.0389Z" fill="#2A007C" />
                            </g>
                            <defs>
                                <clipPath id="clip0_3146_15477">
                                    <rect width="98.3755" height="44.7756" fill="white" transform="translate(0.446289 0.73645)" />
                                </clipPath>
                            </defs>
                        </svg>





                    </div>


                </div>



            </div>



            {/* Footer Copyright */}
            <div className='gray-color mt-6' style={{ backgroundColor: '#383A40' }} >
                <div className='container mx-auto mt-2 px-4 py-5'>
                    <div className='flex justify-between items-center text-white'>
                        <div>
                            <p className='block sm:hidden flex  text-sm'>
                                تمامی حقوق این سایت متعلق به سایت <span className='text-orange-700 whitespace-nowrap '> ران اکسپرس</span> می باشد.
                            </p>
                            <p className='hidden sm:block sm:text-sm'>تمام حقوق مادی و معنوی این سایت متعلق به ران <span className='text-orange-700'>اکسپرس</span> است</p>
                        </div>


                        <div className="hidden md:flex space-x-4 items-center">
                            <Link href={''}>
                                <FaFacebook className="text-blue-500  mx-3 dark:bg-slate-800 bg-slate-100 p-1 rounded-sm" size={30} />
                            </Link>
                            <Link href={''}>
                                <FaTelegram className="text-blue-700 dark:bg-slate-800 bg-slate-100 p-1 rounded-sm" size={30} />
                            </Link>
                            <Link href={''}>
                                <FaWhatsapp className="text-green-700 dark:bg-slate-800 bg-slate-100 p-1 rounded-sm" size={30} />
                            </Link>
                            <Link href={''}>
                                <FaInstagram className="text-pink-700 dark:bg-slate-800 bg-slate-100 p-1 rounded-sm" size={30} />
                            </Link>
                        </div>


                    </div>
                </div>
            </div>


        </footer>


    )
}
